In [2]:
import numpy as np
import pandas as pd

In [2]:
data=pd.read_csv('DataAnalyst.csv')

In [3]:
data.head()

,Unnamed: 0,Job Title,Salary Estimate,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,Easy Apply
0,0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Are you eager to roll up your sleeves and harn...,3.2,Vera Institute of Justice\n3.2,"New York, NY","New York, NY",201 to 500 employees,1961,Nonprofit Organization,Social Assistance,Non-Profit,$100 to $500 million (USD),-1,True
1,1,Quality Data Analyst,$37K-$66K (Glassdoor est.),Overview\n\nProvides analytical and technical ...,3.8,Visiting Nurse Service of New York\n3.8,"New York, NY","New York, NY",10000+ employees,1893,Nonprofit Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),-1,-1
2,2,"Senior Data Analyst, Insights & Analytics Team...",$37K-$66K (Glassdoor est.),We’re looking for a Senior Data Analyst who ha...,3.4,Squarespace\n3.4,"New York, NY","New York, NY",1001 to 5000 employees,2003,Company - Private,Internet,Information Technology,Unknown / Non-Applicable,GoDaddy,-1
3,3,Data Analyst,$37K-$66K (Glassdoor est.),Requisition NumberRR-0001939\nRemote:Yes\nWe c...,4.1,Celerity\n4.1,"New York, NY","McLean, VA",201 to 500 employees,2002,Subsidiary or Business Segment,IT Services,Information Technology,$50 to $100 million (USD),-1,-1
4,4,Reporting Data Analyst,$37K-$66K (Glassdoor est.),ABOUT FANDUEL GROUP\n\nFanDuel Group is a worl...,3.9,FanDuel\n3.9,"New York, NY","New York, NY",501 to 1000 employees,2009,Company - Private,Sports & Recreation,"Arts, Entertainment & Recreation",$100 to $500 million (USD),DraftKings,True

In [4]:
data.columns

Index(['Unnamed: 0', 'Job Title', 'Salary Estimate', 'Job Description',
       'Rating', 'Company Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type of ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Easy Apply'],
      dtype='object')

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2253 entries, 0 to 2252
Data columns (total 16 columns):
Unnamed: 0           2253 non-null int64
Job Title            2253 non-null object
Salary Estimate      2253 non-null object
Job Description      2253 non-null object
Rating               2253 non-null float64
Company Name         2252 non-null object
Location             2253 non-null object
Headquarters         2253 non-null object
Size                 2253 non-null object
Founded              2253 non-null int64
Type of ownership    2253 non-null object
Industry             2253 non-null object
Sector               2253 non-null object
Revenue              2253 non-null object
Competitors          2253 non-null object
Easy Apply           2253 non-null object
dtypes: float64(1), int64(2), object(13)
memory usage: 281.8+ KB

In [6]:
data.isna().sum()

Unnamed: 0           0
Job Title            0
Salary Estimate      0
Job Description      0
Rating               0
Company Name         1
Location             0
Headquarters         0
Size                 0
Founded              0
Type of ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy Apply           0
dtype: int64

In [7]:
data.drop(columns="Unnamed: 0",axis=1,inplace=True)

In [8]:
data.head(0)

Empty DataFrame
Columns: [Job Title, Salary Estimate, Job Description, Rating, Company Name, Location, Headquarters, Size, Founded, Type of ownership, Industry, Sector, Revenue, Competitors, Easy Apply]
Index: []

In [9]:
data.columns = data.columns.str.replace(' ', '_')

In [10]:
data.columns

Index(['Job_Title', 'Salary_Estimate', 'Job_Description', 'Rating',
       'Company_Name', 'Location', 'Headquarters', 'Size', 'Founded',
       'Type_of_ownership', 'Industry', 'Sector', 'Revenue', 'Competitors',
       'Easy_Apply'],
      dtype='object')

In [11]:
data.head(3)

,Job_Title,Salary_Estimate,Job_Description,Rating,Company_Name,Location,Headquarters,Size,Founded,Type_of_ownership,Industry,Sector,Revenue,Competitors,Easy_Apply
0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Are you eager to roll up your sleeves and harn...,3.2,Vera Institute of Justice\n3.2,"New York, NY","New York, NY",201 to 500 employees,1961,Nonprofit Organization,Social Assistance,Non-Profit,$100 to $500 million (USD),-1,True
1,Quality Data Analyst,$37K-$66K (Glassdoor est.),Overview\n\nProvides analytical and technical ...,3.8,Visiting Nurse Service of New York\n3.8,"New York, NY","New York, NY",10000+ employees,1893,Nonprofit Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),-1,-1
2,"Senior Data Analyst, Insights & Analytics Team...",$37K-$66K (Glassdoor est.),We’re looking for a Senior Data Analyst who ha...,3.4,Squarespace\n3.4,"New York, NY","New York, NY",1001 to 5000 employees,2003,Company - Private,Internet,Information Technology,Unknown / Non-Applicable,GoDaddy,-1

In [12]:
data.nunique()

Job_Title            1272
Salary_Estimate        90
Job_Description      2253
Rating                 37
Company_Name         1513
Location              253
Headquarters          483
Size                    9
Founded               161
Type_of_ownership      15
Industry               89
Sector                 25
Revenue                14
Competitors           291
Easy_Apply              2
dtype: int64

In [13]:
data.shape

(2253, 15)

In [14]:
data.Job_Title

0       Data Analyst, Center on Immigration and Justic...
1                                    Quality Data Analyst
2       Senior Data Analyst, Insights & Analytics Team...
3                                            Data Analyst
4                                  Reporting Data Analyst
                              ...
2248    RQS - IHHA - 201900004460 -1q Data Security An...
2249                Senior Data Analyst (Corporate Audit)
2250    Technical Business Analyst (SQL, Data analytic...
2251                  Data Analyst 3, Customer Experience
2252                          Senior Quality Data Analyst
Name: Job_Title, Length: 2253, dtype: object

In [15]:
data.isna().sum()

Job_Title            0
Salary_Estimate      0
Job_Description      0
Rating               0
Company_Name         1
Location             0
Headquarters         0
Size                 0
Founded              0
Type_of_ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy_Apply           0
dtype: int64

In [16]:
data.dropna(inplace=True)

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2252 entries, 0 to 2252
Data columns (total 15 columns):
Job_Title            2252 non-null object
Salary_Estimate      2252 non-null object
Job_Description      2252 non-null object
Rating               2252 non-null float64
Company_Name         2252 non-null object
Location             2252 non-null object
Headquarters         2252 non-null object
Size                 2252 non-null object
Founded              2252 non-null int64
Type_of_ownership    2252 non-null object
Industry             2252 non-null object
Sector               2252 non-null object
Revenue              2252 non-null object
Competitors          2252 non-null object
Easy_Apply           2252 non-null object
dtypes: float64(1), int64(1), object(13)
memory usage: 281.5+ KB

In [18]:
data.isna().sum()

Job_Title            0
Salary_Estimate      0
Job_Description      0
Rating               0
Company_Name         0
Location             0
Headquarters         0
Size                 0
Founded              0
Type_of_ownership    0
Industry             0
Sector               0
Revenue              0
Competitors          0
Easy_Apply           0
dtype: int64

In [19]:
data.duplicated().sum()

0

In [20]:
data.head(2)

,Job_Title,Salary_Estimate,Job_Description,Rating,Company_Name,Location,Headquarters,Size,Founded,Type_of_ownership,Industry,Sector,Revenue,Competitors,Easy_Apply
0,"Data Analyst, Center on Immigration and Justic...",$37K-$66K (Glassdoor est.),Are you eager to roll up your sleeves and harn...,3.2,Vera Institute of Justice\n3.2,"New York, NY","New York, NY",201 to 500 employees,1961,Nonprofit Organization,Social Assistance,Non-Profit,$100 to $500 million (USD),-1,True
1,Quality Data Analyst,$37K-$66K (Glassdoor est.),Overview\n\nProvides analytical and technical ...,3.8,Visiting Nurse Service of New York\n3.8,"New York, NY","New York, NY",10000+ employees,1893,Nonprofit Organization,Health Care Services & Hospitals,Health Care,$2 to $5 billion (USD),-1,-1

In [21]:
data.Location.nunique()

253

In [22]:
data.nunique()

Job_Title            1272
Salary_Estimate        90
Job_Description      2252
Rating                 37
Company_Name         1513
Location              253
Headquarters          483
Size                    9
Founded               161
Type_of_ownership      15
Industry               89
Sector                 25
Revenue                14
Competitors           291
Easy_Apply              2
dtype: int64

In [23]:
data.Easy_Apply.value_counts()

-1      2172
True      80
Name: Easy_Apply, dtype: int64

In [24]:
data.Easy_Apply.head(10)

0    True
1      -1
2      -1
3      -1
4    True
5      -1
6      -1
7    True
8      -1
9      -1
Name: Easy_Apply, dtype: object

In [25]:
data.Easy_Apply.replace('-1','False',inplace=True)

In [26]:
data.Easy_Apply

0        True
1       False
2       False
3       False
4        True
        ...
2248    False
2249    False
2250    False
2251    False
2252    False
Name: Easy_Apply, Length: 2252, dtype: object

In [3]:
data2={'col1':[1,3,5,7],
      'col2':[2,5,np.nan, np.nan]}

In [4]:
data2

{'col1': [1, 3, 5, 7], 'col2': [2, 5, nan, nan]}

In [5]:
df=pd.DataFrame(data2)

In [37]:
df

   col1  col2
0     1   2.0
1     3   5.0
2     5   NaN
3     7   NaN

In [38]:
df.isna()

    col1   col2
0  False  False
1  False  False
2  False   True
3  False   True

In [39]:
df.isna().sum()

col1    0
col2    2
dtype: int64

In [6]:
df.dropna(axis=0)

   col1  col2
0     1   2.0
1     3   5.0

In [7]:
df.dropna(axis=1)

   col1
0     1
1     3
2     5
3     7

In [8]:
a=df['col2'].mean()

In [9]:
a

3.5

In [10]:
df.fillna(a)

   col1  col2
0     1   2.0
1     3   5.0
2     5   3.5
3     7   3.5